#include "MIDEA_WATER_HEATER.h"



/*
		美的  热水器
		开关都是这个编码
*/
const uint8_t MIDEA_WATER_HEATER[42] = {4,8,4,8,8,4,4,4,8,4,
														 4,4,4,8,4,8,4,4,
														 8,8,8,4,8,8,8,8,
														 4,8,4,4,4,4,8,4,
														 8,4,8,8,8,8,4,8};

														 
/*******************************************************************************
* 函 数 名         : 打开热水器
* 函数功能		     : 实验程序
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/	
void OPEN_RESHUIQI(void)																				
	{
	//SendADCValue();
	u8 i; 
	u8 data[42] = {4,8,4,8,8,4,4,4,8,4,
								 4,4,4,8,4,8,4,4,
								 8,8,8,4,8,8,8,8,
								 4,8,4,4,4,4,8,4,
								 8,4,8,8,8,8,4,8};

	TIM_Cmd(TIM4, ENABLE); 
	delay_us(9000); 
	TIM_Cmd(TIM4, DISABLE); 
	delay_us(4500);
	TIM_Cmd(TIM4, ENABLE); 	
	
	for(i=0; i<42; i++) 
	{ 
		delay_us(565);//480
		TIM_Cmd(TIM4, DISABLE); 
		
		if(data[i]<5) 
		{   
			delay_us(560);   //0.56ms 620
		} 
		else 
		{  
			delay_us(1690); //1.69ms 
		} 
		TIM_Cmd(TIM4, ENABLE); 
	}
	delay_us(560); 
	TIM_Cmd(TIM4, DISABLE); 	  
}																			
																				
																				
														 
/*******************************************************************************
* 函 数 名         : 打开热水器
* 函数功能		     : 实验程序
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/	
void CLOSE_RESHUIQI(void)																					
{
		OPEN_RESHUIQI();
}



